
let topics = [
    {
        title : "چگونه یک توسعه دهنده فرانت اند بشویم ؟" ,
        description : "در صنعت چاپ، لورم ایپسوم که به آن طرحنما نیز گفته می‌شود، به متن بی‌ معنی و آزمایشی اشاره دارد که برای صفحه ‌آرایی و طراحی گرافیک بکار می ‌رود. طراح سایت از لورم ایپسوم برای پر کردن صفحه استفاده می‌کند تا شکل ظاهری سایت طراحی شده مشخص شود و طراح دید کلی از نوع و اندازه‌ی فونت و ظاهر سایت به دست‌ آورد. طراح پیش از دریافت محتوای اصلی سایت، متن ‌های بی‌معنی را در قالب طراحی خود قرار داده و بر این اساس، چیدمان صفحات را آزمایش می کند. تا اینجا معنی Lorem ipsum را متوجه شدیم." ,  
        creator : "Masocher" ,
    } ,

    {
        title : "چگونه یک توسعه دهنده فرانت اند بشویم ؟" ,
        description : "در صنعت چاپ، لورم ایپسوم که به آن طرحنما نیز گفته می‌شود، به متن بی‌ معنی و آزمایشی اشاره دارد که برای صفحه ‌آرایی و طراحی گرافیک بکار می ‌رود. طراح سایت از لورم ایپسوم برای پر کردن صفحه استفاده می‌کند تا شکل ظاهری سایت طراحی شده مشخص شود و طراح دید کلی از نوع و اندازه‌ی فونت و ظاهر سایت به دست‌ آورد. طراح پیش از دریافت محتوای اصلی سایت، متن ‌های بی‌معنی را در قالب طراحی خود قرار داده و بر این اساس، چیدمان صفحات را آزمایش می کند. تا اینجا معنی Lorem ipsum را متوجه شدیم." ,  
        creator : "Ebo",
    } ,

    {
        title : "چگونه یک توسعه دهنده فرانت اند بشویم ؟" ,
        description : "در صنعت چاپ، لورم ایپسوم که به آن طرحنما نیز گفته می‌شود، به متن بی‌ معنی و آزمایشی اشاره دارد که برای صفحه ‌آرایی و طراحی گرافیک بکار می ‌رود. طراح سایت از لورم ایپسوم برای پر کردن صفحه استفاده می‌کند تا شکل ظاهری سایت طراحی شده مشخص شود و طراح دید کلی از نوع و اندازه‌ی فونت و ظاهر سایت به دست‌ آورد. طراح پیش از دریافت محتوای اصلی سایت، متن ‌های بی‌معنی را در قالب طراحی خود قرار داده و بر این اساس، چیدمان صفحات را آزمایش می کند. تا اینجا معنی Lorem ipsum را متوجه شدیم." ,  
        creator : "Masocher" ,
    } ,

    {
        title : "چگونه یک توسعه دهنده فرانت اند بشویم ؟" ,
        description : "در صنعت چاپ، لورم ایپسوم که به آن طرحنما نیز گفته می‌شود، به متن بی‌ معنی و آزمایشی اشاره دارد که برای صفحه ‌آرایی و طراحی گرافیک بکار می ‌رود. طراح سایت از لورم ایپسوم برای پر کردن صفحه استفاده می‌کند تا شکل ظاهری سایت طراحی شده مشخص شود و طراح دید کلی از نوع و اندازه‌ی فونت و ظاهر سایت به دست‌ آورد. طراح پیش از دریافت محتوای اصلی سایت، متن ‌های بی‌معنی را در قالب طراحی خود قرار داده و بر این اساس، چیدمان صفحات را آزمایش می کند. تا اینجا معنی Lorem ipsum را متوجه شدیم." ,  
        creator : "Ebo",
    } ,

    {
        title : "چگونه یک توسعه دهنده فرانت اند بشویم ؟" ,
        description : "در صنعت چاپ، لورم ایپسوم که به آن طرحنما نیز گفته می‌شود، به متن بی‌ معنی و آزمایشی اشاره دارد که برای صفحه ‌آرایی و طراحی گرافیک بکار می ‌رود. طراح سایت از لورم ایپسوم برای پر کردن صفحه استفاده می‌کند تا شکل ظاهری سایت طراحی شده مشخص شود و طراح دید کلی از نوع و اندازه‌ی فونت و ظاهر سایت به دست‌ آورد. طراح پیش از دریافت محتوای اصلی سایت، متن ‌های بی‌معنی را در قالب طراحی خود قرار داده و بر این اساس، چیدمان صفحات را آزمایش می کند. تا اینجا معنی Lorem ipsum را متوجه شدیم." ,  
        creator : "Masocher" ,
    } ,

    {
        title : "چگونه یک توسعه دهنده فرانت اند بشویم ؟" ,
        description : "در صنعت چاپ، لورم ایپسوم که به آن طرحنما نیز گفته می‌شود، به متن بی‌ معنی و آزمایشی اشاره دارد که برای صفحه ‌آرایی و طراحی گرافیک بکار می ‌رود. طراح سایت از لورم ایپسوم برای پر کردن صفحه استفاده می‌کند تا شکل ظاهری سایت طراحی شده مشخص شود و طراح دید کلی از نوع و اندازه‌ی فونت و ظاهر سایت به دست‌ آورد. طراح پیش از دریافت محتوای اصلی سایت، متن ‌های بی‌معنی را در قالب طراحی خود قرار داده و بر این اساس، چیدمان صفحات را آزمایش می کند. تا اینجا معنی Lorem ipsum را متوجه شدیم." ,
        creator : "Ebo",
    } ,

    {
        title : "چگونه یک توسعه دهنده فرانت اند بشویم ؟" ,
        description : "در صنعت چاپ، لورم ایپسوم که به آن طرحنما نیز گفته می‌شود، به متن بی‌ معنی و آزمایشی اشاره دارد که برای صفحه ‌آرایی و طراحی گرافیک بکار می ‌رود. طراح سایت از لورم ایپسوم برای پر کردن صفحه استفاده می‌کند تا شکل ظاهری سایت طراحی شده مشخص شود و طراح دید کلی از نوع و اندازه‌ی فونت و ظاهر سایت به دست‌ آورد. طراح پیش از دریافت محتوای اصلی سایت، متن ‌های بی‌معنی را در قالب طراحی خود قرار داده و بر این اساس، چیدمان صفحات را آزمایش می کند. تا اینجا معنی Lorem ipsum را متوجه شدیم." ,  
        creator : "Masocher" ,
    } ,
]


// const userQuestions = [
//     {id : 1 , title : "چگونه یک توسعه دهنده فرانت اند بشویم ؟" ,
//         description : "در صنعت چاپ، لورم ایپسوم که به آن طرحنما نیز گفته می‌شود، به متن بی‌ معنی و آزمایشی اشاره دارد که برای صفحه ‌آرایی و طراحی گرافیک بکار می ‌رود. طراح سایت از لورم ایپسوم برای پر کردن صفحه استفاده می‌کند تا شکل ظاهری سایت طراحی شده مشخص شود و طراح دید کلی از نوع و اندازه‌ی فونت و ظاهر سایت به دست‌ آورد. طراح پیش از دریافت محتوای اصلی سایت، متن ‌های بی‌معنی را در قالب طراحی خود قرار داده و بر این اساس، چیدمان صفحات را آزمایش می کند. تا اینجا معنی Lorem ipsum را متوجه شدیم." ,  
//         tags : [
//             "پایتون" , "برنامه نویسی" , "جاوااسکریپت"
//         ] ,
//     } ,

//     {id : 2 , title : "چگونه یک توسعه دهنده فرانت اند بشویم ؟" ,
//         description : "در صنعت چاپ، لورم ایپسوم که به آن طرحنما نیز گفته می‌شود، به متن بی‌ معنی و آزمایشی اشاره دارد که برای صفحه ‌آرایی و طراحی گرافیک بکار می ‌رود. طراح سایت از لورم ایپسوم برای پر کردن صفحه استفاده می‌کند تا شکل ظاهری سایت طراحی شده مشخص شود و طراح دید کلی از نوع و اندازه‌ی فونت و ظاهر سایت به دست‌ آورد. طراح پیش از دریافت محتوای اصلی سایت، متن ‌های بی‌معنی را در قالب طراحی خود قرار داده و بر این اساس، چیدمان صفحات را آزمایش می کند. تا اینجا معنی Lorem ipsum را متوجه شدیم." ,  
//         tags : [
//             "پایتون" , "برنامه نویسی" , "جاوااسکریپت"
//         ] ,
//     } ,

//     {id : 3 , title : "چگونه یک توسعه دهنده فرانت اند بشویم ؟" ,
//         description : "در صنعت چاپ، لورم ایپسوم که به آن طرحنما نیز گفته می‌شود، به متن بی‌ معنی و آزمایشی اشاره دارد که برای صفحه ‌آرایی و طراحی گرافیک بکار می ‌رود. طراح سایت از لورم ایپسوم برای پر کردن صفحه استفاده می‌کند تا شکل ظاهری سایت طراحی شده مشخص شود و طراح دید کلی از نوع و اندازه‌ی فونت و ظاهر سایت به دست‌ آورد. طراح پیش از دریافت محتوای اصلی سایت، متن ‌های بی‌معنی را در قالب طراحی خود قرار داده و بر این اساس، چیدمان صفحات را آزمایش می کند. تا اینجا معنی Lorem ipsum را متوجه شدیم." ,  
//         tags : [
//             "پایتون" , "برنامه نویسی" , "جاوااسکریپت"
//         ] ,
//     } ,

//     {id : 4 , title : "چگونه یک توسعه دهنده فرانت اند بشویم ؟" ,
//         description : "در صنعت چاپ، لورم ایپسوم که به آن طرحنما نیز گفته می‌شود، به متن بی‌ معنی و آزمایشی اشاره دارد که برای صفحه ‌آرایی و طراحی گرافیک بکار می ‌رود. طراح سایت از لورم ایپسوم برای پر کردن صفحه استفاده می‌کند تا شکل ظاهری سایت طراحی شده مشخص شود و طراح دید کلی از نوع و اندازه‌ی فونت و ظاهر سایت به دست‌ آورد. طراح پیش از دریافت محتوای اصلی سایت، متن ‌های بی‌معنی را در قالب طراحی خود قرار داده و بر این اساس، چیدمان صفحات را آزمایش می کند. تا اینجا معنی Lorem ipsum را متوجه شدیم." ,  
//         tags : [
//             "پایتون" , "برنامه نویسی" , "جاوااسکریپت"
//         ] ,
//     } ,

    // {id : 5 , title : "چگونه یک توسعه دهنده فرانت اند بشویم ؟" ,
    //     description : "در صنعت چاپ، لورم ایپسوم که به آن طرحنما نیز گفته می‌شود، به متن بی‌ معنی و آزمایشی اشاره دارد که برای صفحه ‌آرایی و طراحی گرافیک بکار می ‌رود. طراح سایت از لورم ایپسوم برای پر کردن صفحه استفاده می‌کند تا شکل ظاهری سایت طراحی شده مشخص شود و طراح دید کلی از نوع و اندازه‌ی فونت و ظاهر سایت به دست‌ آورد. طراح پیش از دریافت محتوای اصلی سایت، متن ‌های بی‌معنی را در قالب طراحی خود قرار داده و بر این اساس، چیدمان صفحات را آزمایش می کند. تا اینجا معنی Lorem ipsum را متوجه شدیم." ,  
    //     tags : [
    //         "پایتون" , "برنامه نویسی" , "جاوااسکریپت"
    //     ] ,
    // } ,
// ];

const reducer = () => {
    return topics
}
export default reducer;