// import assets
import './assets/style/main.css'
import './assets/style/data.css'

// import components
import QuestionBox from "./main-page/QuestionBox";

function Data() {

    let data = [
        {id : 1 , title : 'چگونه یک توسعه دهنده فرانت اند بشویم ؟' ,
            description : 'در صنعت چاپ، لورم ایپسوم که به آن طرحنما نیز گفته می‌شود، به متن بی‌ معنی و آزمایشی اشاره دارد که برای صفحه ‌آرایی و طراحی گرافیک بکار می ‌رود. طراح سایت از لورم ایپسوم برای پر کردن صفحه استفاده می‌کند تا شکل ظاهری سایت طراحی شده مشخص شود و طراح دید کلی از نوع و اندازه‌ی فونت و ظاهر سایت به دست‌ آورد. طراح پیش از دریافت محتوای اصلی سایت، متن ‌های بی‌معنی را در قالب طراحی خود قرار داده و بر این اساس، چیدمان صفحات را آزمایش می کند. تا اینجا معنی Lorem ipsum را متوجه شدیم.' ,  
            tags : [
                "پایتون" , "برنامه نویسی" , "جاوااسکریپت"
            ] ,
            creator : 'Masocher' ,
            likeManner : false
        } ,

        {id : 2 , title : 'چگونه یک توسعه دهنده فرانت اند بشویم ؟' ,
            description : 'در صنعت چاپ، لورم ایپسوم که به آن طرحنما نیز گفته می‌شود، به متن بی‌ معنی و آزمایشی اشاره دارد که برای صفحه ‌آرایی و طراحی گرافیک بکار می ‌رود. طراح سایت از لورم ایپسوم برای پر کردن صفحه استفاده می‌کند تا شکل ظاهری سایت طراحی شده مشخص شود و طراح دید کلی از نوع و اندازه‌ی فونت و ظاهر سایت به دست‌ آورد. طراح پیش از دریافت محتوای اصلی سایت، متن ‌های بی‌معنی را در قالب طراحی خود قرار داده و بر این اساس، چیدمان صفحات را آزمایش می کند. تا اینجا معنی Lorem ipsum را متوجه شدیم.' ,  
            tags : [
                "پایتون" , "برنامه نویسی" , "جاوااسکریپت"
            ] ,
            creator : 'Ebo'
        } ,

        {id : 3 , title : 'چگونه یک توسعه دهنده فرانت اند بشویم ؟' ,
            description : 'در صنعت چاپ، لورم ایپسوم که به آن طرحنما نیز گفته می‌شود، به متن بی‌ معنی و آزمایشی اشاره دارد که برای صفحه ‌آرایی و طراحی گرافیک بکار می ‌رود. طراح سایت از لورم ایپسوم برای پر کردن صفحه استفاده می‌کند تا شکل ظاهری سایت طراحی شده مشخص شود و طراح دید کلی از نوع و اندازه‌ی فونت و ظاهر سایت به دست‌ آورد. طراح پیش از دریافت محتوای اصلی سایت، متن ‌های بی‌معنی را در قالب طراحی خود قرار داده و بر این اساس، چیدمان صفحات را آزمایش می کند. تا اینجا معنی Lorem ipsum را متوجه شدیم.' ,  
            tags : [
                "پایتون" , "برنامه نویسی" , "جاوااسکریپت"
            ] ,
            creator : 'Masocher' ,
            likeManner : false
        } ,

        {id : 4 , title : 'چگونه یک توسعه دهنده فرانت اند بشویم ؟' ,
            description : 'در صنعت چاپ، لورم ایپسوم که به آن طرحنما نیز گفته می‌شود، به متن بی‌ معنی و آزمایشی اشاره دارد که برای صفحه ‌آرایی و طراحی گرافیک بکار می ‌رود. طراح سایت از لورم ایپسوم برای پر کردن صفحه استفاده می‌کند تا شکل ظاهری سایت طراحی شده مشخص شود و طراح دید کلی از نوع و اندازه‌ی فونت و ظاهر سایت به دست‌ آورد. طراح پیش از دریافت محتوای اصلی سایت، متن ‌های بی‌معنی را در قالب طراحی خود قرار داده و بر این اساس، چیدمان صفحات را آزمایش می کند. تا اینجا معنی Lorem ipsum را متوجه شدیم.' ,  
            tags : [
                "پایتون" , "برنامه نویسی" , "جاوااسکریپت"
            ] ,
            creator : 'Ebo'
        } ,

        {id : 5 , title : 'چگونه یک توسعه دهنده فرانت اند بشویم ؟' ,
            description : 'در صنعت چاپ، لورم ایپسوم که به آن طرحنما نیز گفته می‌شود، به متن بی‌ معنی و آزمایشی اشاره دارد که برای صفحه ‌آرایی و طراحی گرافیک بکار می ‌رود. طراح سایت از لورم ایپسوم برای پر کردن صفحه استفاده می‌کند تا شکل ظاهری سایت طراحی شده مشخص شود و طراح دید کلی از نوع و اندازه‌ی فونت و ظاهر سایت به دست‌ آورد. طراح پیش از دریافت محتوای اصلی سایت، متن ‌های بی‌معنی را در قالب طراحی خود قرار داده و بر این اساس، چیدمان صفحات را آزمایش می کند. تا اینجا معنی Lorem ipsum را متوجه شدیم.' ,  
            tags : [
                "پایتون" , "برنامه نویسی" , "جاوااسکریپت"
            ] ,
            creator : 'Masocher' ,
            likeManner : false
        } ,

        {id : 6 , title : 'چگونه یک توسعه دهنده فرانت اند بشویم ؟' ,
            description : 'در صنعت چاپ، لورم ایپسوم که به آن طرحنما نیز گفته می‌شود، به متن بی‌ معنی و آزمایشی اشاره دارد که برای صفحه ‌آرایی و طراحی گرافیک بکار می ‌رود. طراح سایت از لورم ایپسوم برای پر کردن صفحه استفاده می‌کند تا شکل ظاهری سایت طراحی شده مشخص شود و طراح دید کلی از نوع و اندازه‌ی فونت و ظاهر سایت به دست‌ آورد. طراح پیش از دریافت محتوای اصلی سایت، متن ‌های بی‌معنی را در قالب طراحی خود قرار داده و بر این اساس، چیدمان صفحات را آزمایش می کند. تا اینجا معنی Lorem ipsum را متوجه شدیم.' ,  
            tags : [
                "پایتون" , "برنامه نویسی" , "جاوااسکریپت" ,
                "پایتون" , "برنامه نویسی" ,
            ] ,
            creator : 'Ebo'
        } ,

        {id : 7 , title : 'چگونه یک توسعه دهنده فرانت اند بشویم ؟' ,
            description : 'در صنعت چاپ، لورم ایپسوم که به آن طرحنما نیز گفته می‌شود، به متن بی‌ معنی و آزمایشی اشاره دارد که برای صفحه ‌آرایی و طراحی گرافیک بکار می ‌رود. طراح سایت از لورم ایپسوم برای پر کردن صفحه استفاده می‌کند تا شکل ظاهری سایت طراحی شده مشخص شود و طراح دید کلی از نوع و اندازه‌ی فونت و ظاهر سایت به دست‌ آورد. طراح پیش از دریافت محتوای اصلی سایت، متن ‌های بی‌معنی را در قالب طراحی خود قرار داده و بر این اساس، چیدمان صفحات را آزمایش می کند. تا اینجا معنی Lorem ipsum را متوجه شدیم.' ,  
            tags : [
                "پایتون" , "برنامه نویسی" , "جاوااسکریپت"
            ] ,
            creator : 'Masocher' ,
            likeManner : false
        } ,
    ]

    return ( 
        <div className="questions">
            {data.map(item => 
                    <QuestionBox 
                        key={item.id} 
                        likeManner={item.likeManner}
                        creator={item.creator} 
                        tags={item.tags} 
                        id={item.id} 
                        tit={item.title} 
                        desc={item.description} 
                />)}
        </div>
     );
}

export default Data;